Revit 2024 API
SpecTypeId.CostPerArea Property
 Cost per Area, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CostPerArea { get; }
Visual Basic
Public Shared ReadOnly Property CostPerArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CostPerArea {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace